Module 5 Exercise
Ansel Gomez
Section 2

In [119]:
import pandas as pd
from pandas import Series, DataFrame

Create a dataframe, df, that stores these three types of scores with axis labels as respective movie names and column labels as 'IMDB', 'Rotten tomatoes' and 'Metacritic' respectively. (2 points)

In [120]:
data = [[8.1, 96, 75], [7.4, 87, 75], [7.6, 90, 76],
        [7.9, 91, 90], [8.1, 83, 74]]

df = pd.DataFrame(data, columns = ['IMDB', 'Rotten Tomatoes', 'Metacritic'], 
                  index = ['CODA', 'Belfast', 'King Richard', 'Licorice Pizza', 'Dune'])

df

                IMDB  Rotten Tomatoes  Metacritic
CODA             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90
Dune             8.1               83          74

Name the df's index as 'movies' and its columns as 'scores'. (1 point)

In [121]:
df.index.name = 'movies'
df.columns.name = 'scores'
df

scores          IMDB  Rotten Tomatoes  Metacritic
movies
CODA             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90
Dune             8.1               83          74

Use df to display the metacritic scores of CODA and Dune. (1 point)

In [122]:
df.loc['CODA', ['Metacritic']]

scores
Metacritic    75.0
Name: CODA, dtype: float64

In [123]:
df.loc['Dune', ['Metacritic']]

scores
Metacritic    74.0
Name: Dune, dtype: float64

Sort df by movie names. (1 point)

In [124]:
df.sort_index()

scores          IMDB  Rotten Tomatoes  Metacritic
movies
Belfast          7.4               87          75
CODA             8.1               96          75
Dune             8.1               83          74
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90

Sort df by score names. (1 point)

In [125]:
df.sort_index(axis='columns')

scores          IMDB  Metacritic  Rotten Tomatoes
movies
CODA             8.1          75               96
Belfast          7.4          75               87
King Richard     7.6          76               90
Licorice Pizza   7.9          90               91
Dune             8.1          74               83

Sort df by IMDB scores in descending order. (1 point)

In [126]:
df.sort_values(by = 'IMDB')

scores          IMDB  Rotten Tomatoes  Metacritic
movies
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90
CODA             8.1               96          75
Dune             8.1               83          74

Sort df first by Metacritic scores and next by Rotten Tomatoes scores. (1 point)

In [127]:
df.sort_values(by = ['Metacritic', 'Rotten Tomatoes'])

scores          IMDB  Rotten Tomatoes  Metacritic
movies
Dune             8.1               83          74
Belfast          7.4               87          75
CODA             8.1               96          75
King Richard     7.6               90          76
Licorice Pizza   7.9               91          90

Update df to change the IMDB score for 'Licorice Pizza' to 8.5. (1 point)

In [128]:
df.loc['Licorice Pizza', ['IMDB']] = 8.5
df

scores          IMDB  Rotten Tomatoes  Metacritic
movies
CODA             8.1               96          75
Belfast          7.4               87          75
King Richard     7.6               90          76
Licorice Pizza   8.5               91          90
Dune             8.1               83          74

Drop 'King Richard' from df. (1 point)

In [129]:
df.drop(['King Richard'])

scores          IMDB  Rotten Tomatoes  Metacritic
movies
CODA             8.1               96          75
Belfast          7.4               87          75
Licorice Pizza   8.5               91          90
Dune             8.1               83          74

Github link

https://github.com/amg515/iti221-excercises